/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "‏%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "‏%1$@، %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "‏%1$@؛ %2$d %3$@؛ بيانات = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULL>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "تسوية AA";

/* Label of field in authority info access extension */
"Access Location" = "موقع الوصول";

/* Label of field in authority info access extension */
"Access Method" = "طريقة الوصول";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "تم تغيير الانضمام";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "خوارزمية";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "رقم الشهادة التسلسلي المصدق";

/* Authority info access extension label */
"Authority Information Access" = "الوصول المعلومات المصدقة";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "معرف مفتاح السلطة";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "قيود أساسية";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "سلسلة ثنائيات";

/* No comment provided by engineer. */
"bits" = "بت";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "سلسة بايت";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "بايت";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "تسوية CA";

/* X.509 key usage bitfield name */
"Cert Sign" = "تصديق الشهادة";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "سلطة الشهادة";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "تعليق الشهادة";

/* Certificate Policies extension label */
"Certificate Policies" = "سياسات الشهادة";

/* No comment provided by engineer. */
"Certificate Type" = "نوع الشهادة";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "توقيف العملية";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "حَرِج";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "نقاط توزيع CRL";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "مصدر CRL";

/* X.509 key usage bitfield name */
"CRL Sign" = "تصديق CRL";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "بيانات";

/* X.509 key usage bitfield name */
"Data Encipherment" = "بيانات Encipherment";

/* X.509 key usage bitfield name */
"Decipher Only" = "فك المشفر فقط";

/* X.509 key usage bitfield name */
"Digital Signature" = "توقيع رقمي";

/* label for general name field value */
"Directory Name" = "اسم الدليل";

/* label for general name field value */
"DNS Name" = "اسم DNS";

/* label for general name field value */
"EDI Party Name" = "اسم مجموعة EDI";

/* label for general name field value */
"Email Address" = "عنوان البريد الإلكتروني";

/* X.509 key usage bitfield name */
"Encipher Only" = "المُشفر فقط";

/* No comment provided by engineer. */
"Expired" = "انتهت الصلاحية";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "انتهاء الصلاحية";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "نص فاضح";

/* Extended key usage extension label */
"Extended Key Usage" = "استعمال المفتاح الممدد";

/* Label used for General Name entry when value is invalid */
"General Name" = "اسم عام";

/* Label used for General Names when value is invalid */
"General Names" = "أسماء عامة";

/* No comment provided by engineer. */
"Hostname mismatch." = "اسم المضيف غير متطابق.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "تعينات سياسة ممنوعة";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "%@ غير صالح";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "سلسلة الشهادة المرتبطة غير صالحة.";

/* label for general name field value */
"IP Address" = "عنوان IP";

/* No comment provided by engineer. */
"Issued By" = "تم الإصدار بواسطة";

/* No comment provided by engineer. */
"Issuer Name" = "اسم المصدر";

/* No comment provided by engineer. */
"Issuer Summary" = "ملخص المُصدر";

/* No comment provided by engineer. */
"Issuer Unique ID" = "هوية المصدر الفريدة";

/* X.509 key usage bitfield name */
"Key Agreement" = "إتفاقية المفتاح";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "تسوية المفتاح";

/* X.509 key usage bitfield name */
"Key Encipherment" = "Key Encipherment";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "معرف المفتاح";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "الاسم النسبي لمصدر CRL";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "لا";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "غير قابل للرفض";

/* field value of parameters field when no parameters are present */
"none" = "لا شيء";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "غير معروض (رمز = %1$@; طول %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "ليست صالحة بعد";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "ليست صالحة قبل";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "أرقام الإشعار";

/* Netscape certificate type usage value */
"Object Signing" = "توقيع الكائن";

/* Netscape certificate type usage value */
"Object Signing CA" = "توقيع الكائن CA";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "معرّف الكائن طويل جدًا";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "انتهت صلاحية شهادة واحدة أو أكثر أو إنها غير صالحة بعد.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "تم العثور على ملحق واحد مهم غير مدعوم أو أكثر.";

/* Label of field in Certificate Policies extension */
"Organization" = "المنظمة";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "اسم آخر";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "المُعامِلات";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "قيد طول المسار";

/* Policy constraints extension label */
"Policy Constraints" = "قيود السياسة";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "معرف سياسة #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "مؤهل سياسة #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "لم يتم تحقيق متطلبات السياسة.";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "مدة استعمال المفتاح الخاص";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "سحب الامتياز";

/* No comment provided by engineer. */
"Public Key Algorithm" = "خوارزمية مفتاح العمومي";

/* No comment provided by engineer. */
"Public Key Data" = "بيانات المفتاح العمومي";

/* Label of field in extended key usage extension */
"Purpose" = "هدف";

/* Label of field in Certificate Policies extension */
"Qualifier" = "مؤهل";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "أسباب";

/* label for general name field value */
"Registered ID" = "هوية مسجلة";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "يتطلب سياسة واضحة";

/* Netscape certificate type usage value */
"Reserved" = "محفوظة";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "الشهادة الجذرية غير موثوق بها.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME
";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "متتالي";

/* No comment provided by engineer. */
"Serial Number" = "الرقم التسلسلي";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "تعيين";

/* No comment provided by engineer. */
"Signature" = "التوقيع";

/* No comment provided by engineer. */
"Signature Algorithm" = "خوارزمية التوقيع";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "عميل SSL";

/* Netscape certificate type usage value */
"SSL server" = "خادم SSL";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "معرف مفتاح الموضوع";

/* No comment provided by engineer. */
"Subject Name" = "اسم الموضوع";

/* No comment provided by engineer. */
"Subject Unique ID" = "هوية الموضوع الفريدة";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "باطل";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "انتهت صلاحية المصدر لهذه الشهادة";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "هذه الشهادة لها مصدر غير صالح";

/* No comment provided by engineer. */
"This certificate has expired" = "انتهت صلاحية هذه الشهادة";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "هذه الشهادة غير صالحة بعد";

/* The certificate is temporally valid */
"This certificate is valid" = "هذه الشهادة صالحة";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "%@ غير موزع";

/* CRL Distribution Points extension supported reason name */
"Unused" = "غير مستخدم";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "الاستعمال";

/* No comment provided by engineer. */
"Valid from" = "صالح من";

/* No comment provided by engineer. */
"Version" = "إصدار";

/* label for general name field value */
"X.400 Address" = "عنوان X.400";

/* Label of a X.501 Name */
"X.501 Name" = "اسم X.501";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "إصدار X.509 شهادة %1$d %2$s";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "نعم";

